---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarRoundingManager.SegmentLengthRoundingMethod
source: html/b77e2c03-3fcc-e6ba-99c9-9ce2f0a3c121.htm
---
# Autodesk.Revit.DB.Structure.RebarRoundingManager.SegmentLengthRoundingMethod Property

Identifies the segment length rounding method

## Syntax (C#)
```csharp
public RoundingMethod SegmentLengthRoundingMethod { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: IsActiveOnElement property is false.